Repository: CofficLab/Lumi
Catalog: Packages/PluginRegistryManager/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Caches package metadata for faster access
zh_hans: 缓存包元数据以加快访问
zh_hk: 快取套件中繼資料以加快存取

source: Configure authentication for private registries
zh_hans: 为私有注册表配置身份验证
zh_hk: 為私有註冊表設定驗證

source: Configure registry mirrors for better performance
zh_hans: 配置注册表镜像以提升性能
zh_hk: 設定註冊表鏡像以提升效能

source: Configures mirrors based on your region and preferences
zh_hans: 根据你的地区和偏好配置镜像
zh_hk: 根據你的地區和偏好設定鏡像

source: Connects to package registries for dependency resolution
zh_hans: 连接包注册表以解析依赖
zh_hk: 連接套件註冊表以解析相依性

source: Current Registry
zh_hans: 当前注册表
zh_hk: 当前注册表

source: Docker registry updated. Please restart Docker Desktop.
zh_hans: Docker 仓库已更新。请重启 Docker Desktop。
zh_hk: Docker 倉庫已更新。請重啟 Docker Desktop。

source: Ensure secure connections to package registries
zh_hans: 确保与包注册表的安全连接
zh_hk: 確保與套件註冊表的安全連線

source: Failed to set {type}: {error}
zh_hans: 设置 {type} 失败：{error}
zh_hk: 設置 {type} 失敗：{error}

source: Failed: {error}
zh_hans: 失败：{error}
zh_hk: 失敗：{error}

source: How It Works
zh_hans: 工作原理
zh_hk: 工作原理

source: Manage all your package registries in one place
zh_hans: 在一个地方管理所有包仓库
zh_hk: 在一個地方管理所有包倉庫

source: Manage and configure Lumi registries for package management
zh_hans: 管理和配置 Lumi 注册表以进行包管理
zh_hk: 管理和設定 Lumi 註冊表以進行套件管理

source: Mirror Configuration
zh_hans: 镜像配置
zh_hk: 鏡像設定

source: Optimize package download speeds with regional mirrors
zh_hans: 通过区域镜像优化包下载速度
zh_hk: 透過區域鏡像最佳化套件下載速度

source: Performance Optimization
zh_hans: 性能优化
zh_hk: 效能最佳化

source: Provides a unified interface for registry management
zh_hans: 提供统一的注册表管理界面
zh_hk: 提供統一的註冊表管理介面

source: Refresh
zh_hans: 刷新
zh_hk: 重新整理

source: Registry Management
zh_hans: 注册表管理
zh_hk: 註冊表管理

source: Registry Manager
zh_hans: 注册表管理器
zh_hk: 注册表管理器

source: Regularly update registry cache for latest packages
zh_hans: 定期更新注册表缓存以获取最新包
zh_hk: 定期更新註冊表快取以取得最新套件

source: Secure Connections
zh_hans: 安全连接
zh_hk: 安全連線

source: Switch Source
zh_hans: 切换来源
zh_hk: 切换来源

source: Switched {type} registry to {name}
zh_hans: 已切换 {type} 仓库到 {name}
zh_hk: 已切換 {type} 倉庫到 {name}

source: Use regional mirrors for faster downloads
zh_hans: 使用区域镜像加快下载
zh_hk: 使用區域鏡像加快下載

source: User Manual
zh_hans: 使用手册
zh_hk: 使用手冊

source: Overview
zh_hans: 概述
zh_hk: 概述

source: This manual covers the interface and basic operations of the Registry Manager: viewing the current registry of each package manager and switching it to a preset mirror.
zh_hans: 本手册介绍注册表管理器的界面与基本操作:查看各包管理器的当前镜像源,并切换到预设镜像源。
zh_hk: 本手冊介紹註冊表管理器的介面與基本操作:檢視各套件管理器的目前鏡像來源,並切換到預設鏡像來源。

source: Interface
zh_hans: 界面说明
zh_hk: 介面說明

source: Card grid: one card per registry type, such as NPM, Yarn, PNPM, Docker, Pip, and Go Proxy.
zh_hans: 「卡片网格」:每种注册表类型一张卡片,如 NPM、Yarn、PNPM、Docker、Pip 和 Go Proxy。
zh_hk: 「卡片格狀排列」:每種註冊表類型一張卡片,如 NPM、Yarn、PNPM、Docker、Pip 和 Go Proxy。

source: Card header: the registry icon and name, with a refresh button on the right.
zh_hans: 卡片头部:注册表图标和名称,右侧为刷新按钮。
zh_hk: 卡片頭部:註冊表圖示和名稱,右側為重新整理按鈕。

source: Current Registry: the registry address in use; click it to copy the address to the clipboard.
zh_hans: 「当前注册表」:正在使用的注册表地址,点击可将地址复制到剪贴板。
zh_hk: 「目前註冊表」:正在使用的註冊表位址,點擊可將位址複製到剪貼簿。

source: Switch Source: a menu of preset mirrors; the one in use is marked with a checkmark.
zh_hans: 「切换来源」:预设镜像菜单,正在使用的镜像带有对勾标记。
zh_hk: 「切換來源」:預設鏡像選單,正在使用的鏡像帶有勾選標記。

source: Basic Operations
zh_hans: 基本操作
zh_hk: 基本操作

source: Open the Registry Manager tab; the current registry of each type is read automatically.
zh_hans: 打开注册表管理器标签页,各类型的当前注册表会自动读取。
zh_hk: 開啟註冊表管理器標籤頁,各類型的目前註冊表會自動讀取。

source: Click the refresh button on a card to re-read that registry.
zh_hans: 点击卡片上的刷新按钮,重新读取该注册表。
zh_hk: 點擊卡片上的重新整理按鈕,重新讀取該註冊表。

source: Click the Current Registry address to copy it; a toast confirms the copy.
zh_hans: 点击「当前注册表」地址即可复制,弹出提示确认已复制。
zh_hk: 點擊「目前註冊表」位址即可複製,彈出提示確認已複製。

source: Choose a mirror from the Switch Source menu to switch the registry.
zh_hans: 从「切换来源」菜单中选择镜像,即可切换注册表。
zh_hk: 從「切換來源」選單中選擇鏡像,即可切換註冊表。

source: Notes
zh_hans: 注意事项
zh_hk: 注意事項

source: A switched registry takes effect for new installations.
zh_hans: 切换注册表后,新安装的依赖才会使用新源。
zh_hk: 切換註冊表後,新安裝的相依套件才會使用新來源。

source: After switching the Docker registry, restart Docker Desktop.
zh_hans: 切换 Docker 注册表后,需要重启 Docker Desktop。
zh_hk: 切換 Docker 註冊表後,需要重新啟動 Docker Desktop。

source: Figure 1: Interface layout
zh_hans: 图 1 界面布局
zh_hk: 圖 1 介面說明

source: Card Grid
zh_hans: 卡片网格
zh_hk: 卡片格狀排列

source: Tips
zh_hans: 使用技巧
zh_hk: 使用技巧
